In [2]:
import pandas as pd

In [12]:
s1 = pd.Series([71,85,56,43,98,66])

In [14]:
type(s1)

pandas.core.series.Series

In [16]:
print(s1)

0    71
1    85
2    56
3    43
4    98
5    66
dtype: int64

In [18]:
s2 = pd.Series([71,85,56,] , index = ["Abhi","Saumya","Palak"])

In [20]:
s2

Abhi      71
Saumya    85
Palak     56
dtype: int64

In [22]:
s2["Abhi"]

71

In [36]:
data = {
    "name":["Abhi","Saumya","Palak"],
    "age":[18,19,21],
    "city":["Delhi","Punjab","Gorakhpur"]
}

In [38]:
index_values = [10595,10393,10202]

In [57]:
df  = pd.DataFrame(data,index = index_values)
df

         name  age       city
10595    Abhi   18      Delhi
10393  Saumya   19     Punjab
10202   Palak   21  Gorakhpur

In [61]:
df = pd.DataFrame(data,index=pd.Index(index_values,name="Student_id"))
df

              name  age       city
Student_id
10595         Abhi   18      Delhi
10393       Saumya   19     Punjab
10202        Palak   21  Gorakhpur

In [63]:
df.index

Index([10595, 10393, 10202], dtype='int64', name='Student_id')

In [65]:
df.columns

Index(['name', 'age', 'city'], dtype='object')